ahtn/keyplus/ports/efm8/efm8/mcu/C8051F350/inc/SI_C8051F350_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F350_GQ
//  C8051F351_GM
//  C8051F352_GQ
//  C8051F353_GM

#ifndef SI_C8051F350_REGISTER_ENUMS_H
#define SI_C8051F350_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F350_Defs.h"
//------------------------------------------------------------------------------
// ADC0BUF Enums (ADC0 Input Buffer Control @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0BUF_ADBNS__FMASK      0x03 ///< Negative Channel Input Select                  
#define ADC0BUF_ADBNS__SHIFT      0x00 ///< Negative Channel Input Select                  
#define ADC0BUF_ADBNS__BYPASS     0x00 ///< Bypass input buffer.                           
#define ADC0BUF_ADBNS__LOW_RANGE  0x01 ///< Select low input buffer range.                 
#define ADC0BUF_ADBNS__HIGH_RANGE 0x02 ///< Select high input buffer range.                
                                                                                           
#define ADC0BUF_ADBNLE__BMASK     0x04 ///< Negative Channel Low Enable                    
#define ADC0BUF_ADBNLE__SHIFT     0x02 ///< Negative Channel Low Enable                    
#define ADC0BUF_ADBNLE__DISABLED  0x00 ///< Disable the negative channel low input buffer. 
#define ADC0BUF_ADBNLE__ENABLED   0x04 ///< Enable the negative channel low input buffer.  
                                                                                           
#define ADC0BUF_ADBNHE__BMASK     0x08 ///< Negative Channel High Enable                   
#define ADC0BUF_ADBNHE__SHIFT     0x03 ///< Negative Channel High Enable                   
#define ADC0BUF_ADBNHE__DISABLED  0x00 ///< Disable the negative channel high input buffer.
#define ADC0BUF_ADBNHE__ENABLED   0x08 ///< Enable the negative channel high input buffer. 
                                                                                           
#define ADC0BUF_ADBPS__FMASK      0x30 ///< Positive Channel Input Select                  
#define ADC0BUF_ADBPS__SHIFT      0x04 ///< Positive Channel Input Select                  
#define ADC0BUF_ADBPS__BYPASS     0x00 ///< Bypass input buffer.                           
#define ADC0BUF_ADBPS__LOW_RANGE  0x10 ///< Select low input buffer range.                 
#define ADC0BUF_ADBPS__HIGH_RANGE 0x20 ///< Select high input buffer range.                
                                                                                           
#define ADC0BUF_ADBPLE__BMASK     0x40 ///< Positive Channel Low Enable                    
#define ADC0BUF_ADBPLE__SHIFT     0x06 ///< Positive Channel Low Enable                    
#define ADC0BUF_ADBPLE__DISABLED  0x00 ///< Disable the positive channel low input buffer. 
#define ADC0BUF_ADBPLE__ENABLED   0x40 ///< Enable the positive channel low input buffer.  
                                                                                           
#define ADC0BUF_ADBPHE__BMASK     0x80 ///< Positive Channel High Enable                   
#define ADC0BUF_ADBPHE__SHIFT     0x07 ///< Positive Channel High Enable                   
#define ADC0BUF_ADBPHE__DISABLED  0x00 ///< Disable the positive channel high input buffer.
#define ADC0BUF_ADBPHE__ENABLED   0x80 ///< Enable the positive channel high input buffer. 
                                                                                           
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xFB)
//------------------------------------------------------------------------------
#define ADC0CF_ADVREF__BMASK    0x04 ///< VREF Source Select                                
#define ADC0CF_ADVREF__SHIFT    0x02 ///< VREF Source Select                                
#define ADC0CF_ADVREF__INTERNAL 0x00 ///< ADC0 uses the internal VREF (2.5 V). Clearing this
                                     ///< bit to 0 also enables the internal voltage        
                                     ///< reference.                                        
#define ADC0CF_ADVREF__EXTERNAL 0x04 ///< ADC0 uses an external VREF.                       
                                                                                            
#define ADC0CF_ADISEL__BMASK    0x10 ///< Interrupt Source Select                           
#define ADC0CF_ADISEL__SHIFT    0x04 ///< Interrupt Source Select                           
#define ADC0CF_ADISEL__SINC3    0x00 ///< SINC3 filter.                                     
#define ADC0CF_ADISEL__FAST     0x10 ///< FAST filter.                                      
                                                                                            
//------------------------------------------------------------------------------
// ADC0CGH Enums (ADC0 Gain Calibration High Byte @ 0xAD)
//------------------------------------------------------------------------------
#define ADC0CGH_GCAL__FMASK 0xFF ///< ADC0 Gain Calibration High Byte
#define ADC0CGH_GCAL__SHIFT 0x00 ///< ADC0 Gain Calibration High Byte
                                                                     
//------------------------------------------------------------------------------
// ADC0CGL Enums (ADC0 Gain Calibration Low Byte @ 0xAB)
//------------------------------------------------------------------------------
#define ADC0CGL_GCAL__FMASK 0xFF ///< ADC0 Gain Calibration Low Byte
#define ADC0CGL_GCAL__SHIFT 0x00 ///< ADC0 Gain Calibration Low Byte
                                                                    
//------------------------------------------------------------------------------
// ADC0CGM Enums (ADC0 Gain Calibration Middle Byte @ 0xAC)
//------------------------------------------------------------------------------
#define ADC0CGM_GCAL__FMASK 0xFF ///< ADC0 Gain Calibration Middle Byte
#define ADC0CGM_GCAL__SHIFT 0x00 ///< ADC0 Gain Calibration Middle Byte
                                                                       
//------------------------------------------------------------------------------
// ADC0CLK Enums (ADC0 Modulator Clock Divisor @ 0xF7)
//------------------------------------------------------------------------------
#define ADC0CLK_ADCCLK__FMASK 0xFF ///< ADC0 Modulator Clock Divisor
#define ADC0CLK_ADCCLK__SHIFT 0x00 ///< ADC0 Modulator Clock Divisor
                                                                    
//------------------------------------------------------------------------------
// ADC0CN Enums (ADC0 Control @ 0xF4)
//------------------------------------------------------------------------------
#define ADC0CN_ADGN__FMASK     0x07 ///< Programmable Gain Setting                     
#define ADC0CN_ADGN__SHIFT     0x00 ///< Programmable Gain Setting                     
#define ADC0CN_ADGN__GAIN_1    0x00 ///< The on-chip PGA gain is 1.                    
#define ADC0CN_ADGN__GAIN_2    0x01 ///< The on-chip PGA gain is 2.                    
#define ADC0CN_ADGN__GAIN_4    0x02 ///< The on-chip PGA gain is 4.                    
#define ADC0CN_ADGN__GAIN_8    0x03 ///< The on-chip PGA gain is 8.                    
#define ADC0CN_ADGN__GAIN_16   0x04 ///< The on-chip PGA gain is 16.                   
#define ADC0CN_ADGN__GAIN_32   0x05 ///< The on-chip PGA gain is 32.                   
#define ADC0CN_ADGN__GAIN_64   0x06 ///< The on-chip PGA gain is 64.                   
#define ADC0CN_ADGN__GAIN_128  0x07 ///< The on-chip PGA gain is 128.                  
                                                                                       
#define ADC0CN_ADBCE__BMASK    0x08 ///< Burnout Current Source Enable                 
#define ADC0CN_ADBCE__SHIFT    0x03 ///< Burnout Current Source Enable                 
#define ADC0CN_ADBCE__DISABLED 0x00 ///< Disable ADC burnout current sources.          
#define ADC0CN_ADBCE__ENABLED  0x08 ///< Enable ADC burnout current sources.           
                                                                                       
#define ADC0CN_ADPOL__BMASK    0x10 ///< Output Polarity                               
#define ADC0CN_ADPOL__SHIFT    0x04 ///< Output Polarity                               
#define ADC0CN_ADPOL__UNIPOLAR 0x00 ///< ADC operates in unipolar mode (straight binary
                                    ///< result).                                      
#define ADC0CN_ADPOL__BIPOLAR  0x10 ///< ADC operates in bipolar mode (2's complement  
                                    ///< result).                                      
                                                                                       
//------------------------------------------------------------------------------
// ADC0COH Enums (ADC0 Offset Calibration High Byte @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0COH_OCAL__FMASK 0xFF ///< ADC0 Offset Calibration High Byte
#define ADC0COH_OCAL__SHIFT 0x00 ///< ADC0 Offset Calibration High Byte
                                                                       
//------------------------------------------------------------------------------
// ADC0COL Enums (ADC0 Offset Calibration Low Byte @ 0xBA)
//------------------------------------------------------------------------------
#define ADC0COL_OCAL__FMASK 0xFF ///< ADC0 Offset Calibration Low Byte
#define ADC0COL_OCAL__SHIFT 0x00 ///< ADC0 Offset Calibration Low Byte
                                                                      
//------------------------------------------------------------------------------
// ADC0COM Enums (ADC0 Offset Calibration Middle Byte @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0COM_OCAL__FMASK 0xFF ///< ADC0 Offset Calibration Middle Byte
#define ADC0COM_OCAL__SHIFT 0x00 ///< ADC0 Offset Calibration Middle Byte
                                                                         
//------------------------------------------------------------------------------
// ADC0DAC Enums (ADC0 Offset DAC @ 0xBF)
//------------------------------------------------------------------------------
#define ADC0DAC_ADCDAC__FMASK 0xFF ///< PGA Offset DAC Magnitude
#define ADC0DAC_ADCDAC__SHIFT 0x00 ///< PGA Offset DAC Magnitude
                                                                
//------------------------------------------------------------------------------
// ADC0DECH Enums (ADC0 Decimation Ratio High Byte @ 0x9B)
//------------------------------------------------------------------------------
#define ADC0DECH_DECI__FMASK 0x07 ///< ADC0 Decimation Ratio High Byte
#define ADC0DECH_DECI__SHIFT 0x00 ///< ADC0 Decimation Ratio High Byte
                                                                      
//------------------------------------------------------------------------------
// ADC0DECL Enums (ADC0 Decimation Ratio Low Byte @ 0x9A)
//------------------------------------------------------------------------------
#define ADC0DECL_DECI__FMASK 0xFF ///< ADC0 Decimation Ratio Low Byte
#define ADC0DECL_DECI__SHIFT 0x00 ///< ADC0 Decimation Ratio Low Byte
                                                                     
//------------------------------------------------------------------------------
// ADC0FH Enums (ADC0 Fast Filter Data High Byte @ 0xFE)
//------------------------------------------------------------------------------
#define ADC0FH_ADC0FH__FMASK 0xFF ///< ADC0 Fast Filter Data High Byte
#define ADC0FH_ADC0FH__SHIFT 0x00 ///< ADC0 Fast Filter Data High Byte
                                                                      
//------------------------------------------------------------------------------
// ADC0FL Enums (ADC0 Data Low Byte @ 0xFC)
//------------------------------------------------------------------------------
#define ADC0FL_ADC0FL__FMASK 0xFF ///< ADC0 Data Low Byte
#define ADC0FL_ADC0FL__SHIFT 0x00 ///< ADC0 Data Low Byte
                                                         
//------------------------------------------------------------------------------
// ADC0FM Enums (ADC0 Fast Filter Data Middle Byte @ 0xFD)
//------------------------------------------------------------------------------
#define ADC0FM_ADC0FM__FMASK 0xFF ///< ADC0 Fast Filter Data Middle Byte
#define ADC0FM_ADC0FM__SHIFT 0x00 ///< ADC0 Fast Filter Data Middle Byte
                                                                        
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data High Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< ADC0 Data High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< ADC0 Data High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< ADC0 Data Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< ADC0 Data Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0M Enums (ADC0 Data Middle Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0M_ADC0M__FMASK 0xFF ///< ADC0 Data Middle Byte
#define ADC0M_ADC0M__SHIFT 0x00 ///< ADC0 Data Middle Byte
                                                          
//------------------------------------------------------------------------------
// ADC0MD Enums (ADC0 Mode @ 0xF3)
//------------------------------------------------------------------------------
#define ADC0MD_ADSM__FMASK               0x07 ///< System Mode Select                                
#define ADC0MD_ADSM__SHIFT               0x00 ///< System Mode Select                                
#define ADC0MD_ADSM__IDLE                0x00 ///< Idle.                                             
#define ADC0MD_ADSM__FULL_INTERNAL_CAL   0x01 ///< Full internal calibration (offset and gain).      
#define ADC0MD_ADSM__SINGLE_CONVERSION   0x02 ///< Single conversion.                                
#define ADC0MD_ADSM__CONT_CONVERSION     0x03 ///< Continuous conversion.                            
#define ADC0MD_ADSM__INTERNAL_OFFSET_CAL 0x04 ///< Internal offset calibration.                      
#define ADC0MD_ADSM__INTERNAL_GAIN_CAL   0x05 ///< Internal gain calibration.                        
#define ADC0MD_ADSM__SYSTEM_OFFSET_CAL   0x06 ///< System offset calibration.                        
#define ADC0MD_ADSM__SYSTEM_GAIN_CAL     0x07 ///< System gain calibration.                          
                                                                                                     
#define ADC0MD_ADEN__BMASK               0x80 ///< ADC0 Enable                                       
#define ADC0MD_ADEN__SHIFT               0x07 ///< ADC0 Enable                                       
#define ADC0MD_ADEN__DISABLED            0x00 ///< Disable the ADC. ADC is in low-power shutdown.    
#define ADC0MD_ADEN__ENABLED             0x80 ///< Enable the ADC. ADC is active and ready to perform
                                              ///< calibrations or conversions.                      
                                                                                                     
//------------------------------------------------------------------------------
// ADC0MUX Enums (ADC0 Analog Multiplexer Control @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0MUX_ADNSEL__FMASK  0x0F ///< ADC0 Negative Multiplexer Channel Select
#define ADC0MUX_ADNSEL__SHIFT  0x00 ///< ADC0 Negative Multiplexer Channel Select
#define ADC0MUX_ADNSEL__ADC0N0 0x00 ///< Select ADC0N.0.                         
#define ADC0MUX_ADNSEL__ADC0N1 0x01 ///< Select ADC0N.1.                         
#define ADC0MUX_ADNSEL__ADC0N2 0x02 ///< Select ADC0N.2.                         
#define ADC0MUX_ADNSEL__ADC0N3 0x03 ///< Select ADC0N.3.                         
#define ADC0MUX_ADNSEL__ADC0N4 0x04 ///< Select ADC0N.4.                         
#define ADC0MUX_ADNSEL__ADC0N5 0x05 ///< Select ADC0N.5.                         
#define ADC0MUX_ADNSEL__ADC0N6 0x06 ///< Select ADC0N.6.                         
#define ADC0MUX_ADNSEL__ADC0N7 0x07 ///< Select ADC0N.7.                         
#define ADC0MUX_ADNSEL__TEMP   0x0F ///< Temperature sensor.                     
                                                                                 
#define ADC0MUX_ADPSEL__FMASK  0xF0 ///< ADC0 Positive Multiplexer Channel Select
#define ADC0MUX_ADPSEL__SHIFT  0x04 ///< ADC0 Positive Multiplexer Channel Select
#define ADC0MUX_ADPSEL__ADC0P0 0x00 ///< Select ADC0P.0.                         
#define ADC0MUX_ADPSEL__ADC0P1 0x10 ///< Select ADC0P.1.                         
#define ADC0MUX_ADPSEL__ADC0P2 0x20 ///< Select ADC0P.2.                         
#define ADC0MUX_ADPSEL__ADC0P3 0x30 ///< Select ADC0P.3.                         
#define ADC0MUX_ADPSEL__ADC0P4 0x40 ///< Select ADC0P.4.                         
#define ADC0MUX_ADPSEL__ADC0P5 0x50 ///< Select ADC0P.5.                         
#define ADC0MUX_ADPSEL__ADC0P6 0x60 ///< Select ADC0P.6.                         
#define ADC0MUX_ADPSEL__ADC0P7 0x70 ///< Select ADC0P.7.                         
#define ADC0MUX_ADPSEL__TEMP   0xF0 ///< Temperature sensor.                     
                                                                                 
//------------------------------------------------------------------------------
// ADC0STA Enums (ADC0 Status @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0STA_ADOVR__BMASK     0x01 ///< Overrun Flag                                      
#define ADC0STA_ADOVR__SHIFT     0x00 ///< Overrun Flag                                      
#define ADC0STA_ADOVR__NOT_SET   0x00 ///< ADC0 overrun did not occur.                       
#define ADC0STA_ADOVR__SET       0x01 ///< ADC0 overrun occurred.                            
                                                                                             
#define ADC0STA_ADERR__BMASK     0x02 ///< Error Flag                                        
#define ADC0STA_ADERR__SHIFT     0x01 ///< Error Flag                                        
#define ADC0STA_ADERR__NOT_SET   0x00 ///< ADC0 error did not occur.                         
#define ADC0STA_ADERR__SET       0x02 ///< ADC0 error occurred.                              
                                                                                             
#define ADC0STA_ADCALC__BMASK    0x04 ///< Calibration Complete Flag                         
#define ADC0STA_ADCALC__SHIFT    0x02 ///< Calibration Complete Flag                         
#define ADC0STA_ADCALC__NOT_SET  0x00 ///< ADC calibration did not complete.                 
#define ADC0STA_ADCALC__SET      0x04 ///< ADC calibration completed.                        
                                                                                             
#define ADC0STA_ADFFC__BMASK     0x08 ///< Fast Filter Clip Flag                             
#define ADC0STA_ADFFC__SHIFT     0x03 ///< Fast Filter Clip Flag                             
#define ADC0STA_ADFFC__NOT_SET   0x00 ///< A fast filter clip did not occur.                 
#define ADC0STA_ADFFC__SET       0x08 ///< A fast filter clip occurred during the conversion.
                                                                                             
#define ADC0STA_ADS3C__BMASK     0x10 ///< SINC3 Filter Clip Flag                            
#define ADC0STA_ADS3C__SHIFT     0x04 ///< SINC3 Filter Clip Flag                            
#define ADC0STA_ADS3C__NOT_SET   0x00 ///< A SINC3 filter clip did not occur.                
#define ADC0STA_ADS3C__SET       0x10 ///< A SINC3 filter clip occurred during the           
                                      ///< conversion.                                       
                                                                                             
#define ADC0STA_ADINT__BMASK     0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0STA_ADINT__SHIFT     0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0STA_ADINT__NOT_SET   0x00 ///< ADC0 has not completed a conversion since the last
                                      ///< time ADINT was cleared.                           
#define ADC0STA_ADINT__SET       0x20 ///< ADC0 completed a data conversion.                 
                                                                                             
#define ADC0STA_ADCBUSY__BMASK   0x40 ///< Calibration In-Progress Flag                      
#define ADC0STA_ADCBUSY__SHIFT   0x06 ///< Calibration In-Progress Flag                      
#define ADC0STA_ADCBUSY__NOT_SET 0x00 ///< An ADC0 calibration is not currently in progress. 
#define ADC0STA_ADCBUSY__SET     0x40 ///< ADC0 calibration is in progress.                  
                                                                                             
#define ADC0STA_ADBUSY__BMASK    0x80 ///< Conversion In-Progress Flag                       
#define ADC0STA_ADBUSY__SHIFT    0x07 ///< Conversion In-Progress Flag                       
#define ADC0STA_ADBUSY__NOT_SET  0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0STA_ADBUSY__SET      0x80 ///< ADC0 conversion is in progress.                   
                                                                                             
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
