ahtn/keyplus/ports/efm8/efm8/mcu/C8051F350/inc/SI_C8051F350_Register_Enums.h
#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable                      
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.          
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.           
                                                                                             
//------------------------------------------------------------------------------
// OSCICL Enums (High Frequency Oscillator Calibration @ 0xB3)
//------------------------------------------------------------------------------
#define OSCICL_OSCICL__FMASK 0x7F ///< Internal Oscillator Calibration
#define OSCICL_OSCICL__SHIFT 0x00 ///< Internal Oscillator Calibration
                                                                      
//------------------------------------------------------------------------------
// OSCICN Enums (High Frequency Oscillator Control @ 0xB2)
//------------------------------------------------------------------------------
#define OSCICN_IFCN__FMASK       0x03 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__SHIFT       0x00 ///< Oscillator Frequency Divider Control             
#define OSCICN_IFCN__HFOSC_DIV_8 0x00 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 8.                                    
#define OSCICN_IFCN__HFOSC_DIV_4 0x01 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 4.                                    
#define OSCICN_IFCN__HFOSC_DIV_2 0x02 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 2.                                    
#define OSCICN_IFCN__HFOSC_DIV_1 0x03 ///< SYSCLK derived from High Frequency Oscillator    
                                      ///< divided by 1.                                    
                                                                                            
#define OSCICN_IFRDY__BMASK      0x40 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__SHIFT      0x06 ///< Oscillator Frequency Ready Flag                  
#define OSCICN_IFRDY__NOT_SET    0x00 ///< The Internal High Frequency Oscillator is not    
                                      ///< running at the programmed frequency.             
#define OSCICN_IFRDY__SET        0x40 ///< The Internal High Frequency Oscillator is running
                                      ///< at the programmed frequency.                     
                                                                                            
#define OSCICN_IOSCEN__BMASK     0x80 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__SHIFT     0x07 ///< Oscillator Enable                                
#define OSCICN_IOSCEN__DISABLED  0x00 ///< Disable the High Frequency Oscillator.           
#define OSCICN_IOSCEN__ENABLED   0x80 ///< Enable the High Frequency Oscillator.            
                                                                                            
//------------------------------------------------------------------------------
// IDA0 Enums (IDAC0 Data @ 0x96)
//------------------------------------------------------------------------------
#define IDA0_IDA0__FMASK 0xFF ///< IDAC0 Data
#define IDA0_IDA0__SHIFT 0x00 ///< IDAC0 Data
                                             
//------------------------------------------------------------------------------
// IDA0CN Enums (IDAC0 Control @ 0xB9)
//------------------------------------------------------------------------------
#define IDA0CN_IDAOMD__FMASK              0x03 ///< Output Mode Select                            
#define IDA0CN_IDAOMD__SHIFT              0x00 ///< Output Mode Select                            
#define IDA0CN_IDAOMD__0P25_MA            0x00 ///< 0.25 mA full-scale output current.            
#define IDA0CN_IDAOMD__0P5_MA             0x01 ///< 0.5 mA full-scale output current.             
#define IDA0CN_IDAOMD__1_MA               0x02 ///< 1.0 mA full-scale output current.             
#define IDA0CN_IDAOMD__2_MA               0x03 ///< 2.0 mA full-scale output current.             
                                                                                                  
#define IDA0CN_CSCEN__BMASK               0x08 ///< Constant Supply Current Enable                
#define IDA0CN_CSCEN__SHIFT               0x03 ///< Constant Supply Current Enable                
#define IDA0CN_CSCEN__CONSTANT_DISABLED   0x00 ///< Current draw on VDD is dependent on the IDA0  
                                               ///< output word.                                  
#define IDA0CN_CSCEN__CONSTANT_ENABLED    0x08 ///< Current draw on VDD is independent of the IDA0
                                               ///< output word.                                  
                                                                                                  
#define IDA0CN_IDACM__FMASK               0x70 ///< Update Source Select                          
#define IDA0CN_IDACM__SHIFT               0x04 ///< Update Source Select                          
#define IDA0CN_IDACM__TIMER0              0x00 ///< DAC output updates on Timer 0 overflow.       
#define IDA0CN_IDACM__TIMER1              0x10 ///< DAC output updates on Timer 1 overflow.       
#define IDA0CN_IDACM__TIMER2              0x20 ///< DAC output updates on Timer 2 overflow.       
#define IDA0CN_IDACM__TIMER3              0x30 ///< DAC output updates on Timer 3 overflow.       
#define IDA0CN_IDACM__CNVSTR_RISING_EDGE  0x40 ///< DAC output updates on rising edge of CNVSTR.  
#define IDA0CN_IDACM__CNVSTR_FALLING_EDGE 0x50 ///< DAC output updates on falling edge of CNVSTR. 
#define IDA0CN_IDACM__CNVSTR_ANY_EDGE     0x60 ///< DAC output updates on any edge of CNVSTR.     
#define IDA0CN_IDACM__IDA0                0x70 ///< DAC output updates on write to IDA0.          
                                                                                                  
#define IDA0CN_IDAEN__BMASK               0x80 ///< IDAC Enable                                   
#define IDA0CN_IDAEN__SHIFT               0x07 ///< IDAC Enable                                   
#define IDA0CN_IDAEN__DISABLED            0x00 ///< Disable IDAC0.                                
#define IDA0CN_IDAEN__ENABLED             0x80 ///< Enable IDAC0.                                 
                                                                                                  
//------------------------------------------------------------------------------
// IDA1 Enums (IDAC1 Data @ 0xDD)
//------------------------------------------------------------------------------
#define IDA1_IDA1__FMASK 0xFF ///< IDAC1 Data
#define IDA1_IDA1__SHIFT 0x00 ///< IDAC1 Data
                                             
//------------------------------------------------------------------------------
// IDA1CN Enums (IDAC1 Control @ 0xD7)
//------------------------------------------------------------------------------
#define IDA1CN_IDAOMD__FMASK              0x03 ///< Output Mode Select                            
#define IDA1CN_IDAOMD__SHIFT              0x00 ///< Output Mode Select                            
#define IDA1CN_IDAOMD__0P25_MA            0x00 ///< 0.25 mA full-scale output current.            
#define IDA1CN_IDAOMD__0P5_MA             0x01 ///< 0.5 mA full-scale output current.             
#define IDA1CN_IDAOMD__1_MA               0x02 ///< 1.0 mA full-scale output current.             
#define IDA1CN_IDAOMD__2_MA               0x03 ///< 2.0 mA full-scale output current.             
                                                                                                  
#define IDA1CN_CSCEN__BMASK               0x08 ///< Constant Supply Current Enable                
#define IDA1CN_CSCEN__SHIFT               0x03 ///< Constant Supply Current Enable                
#define IDA1CN_CSCEN__CONSTANT_DISABLED   0x00 ///< Current draw on VDD is dependent on the IDA1  
                                               ///< output word.                                  
#define IDA1CN_CSCEN__CONSTANT_ENABLED    0x08 ///< Current draw on VDD is independent of the IDA1
                                               ///< output word.                                  
                                                                                                  
#define IDA1CN_IDACM__FMASK               0x70 ///< Update Source Select                          
#define IDA1CN_IDACM__SHIFT               0x04 ///< Update Source Select                          
#define IDA1CN_IDACM__TIMER0              0x00 ///< DAC output updates on Timer 0 overflow.       
#define IDA1CN_IDACM__TIMER1              0x10 ///< DAC output updates on Timer 1 overflow.       
#define IDA1CN_IDACM__TIMER2              0x20 ///< DAC output updates on Timer 2 overflow.       
#define IDA1CN_IDACM__TIMER3              0x30 ///< DAC output updates on Timer 3 overflow.       
#define IDA1CN_IDACM__CNVSTR_RISING_EDGE  0x40 ///< DAC output updates on rising edge of CNVSTR.  
#define IDA1CN_IDACM__CNVSTR_FALLING_EDGE 0x50 ///< DAC output updates on falling edge of CNVSTR. 
#define IDA1CN_IDACM__CNVSTR_ANY_EDGE     0x60 ///< DAC output updates on any edge of CNVSTR.     
#define IDA1CN_IDACM__IDA1                0x70 ///< DAC output updates on write to IDA1.          
                                                                                                  
#define IDA1CN_IDAEN__BMASK               0x80 ///< IDAC Enable                                   
#define IDA1CN_IDAEN__SHIFT               0x07 ///< IDAC Enable                                   
#define IDA1CN_IDAEN__DISABLED            0x00 ///< Disable IDAC1.                                
#define IDA1CN_IDAEN__ENABLED             0x80 ///< Enable IDAC1.                                 
                                                                                                  
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK    0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT    0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED 0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED  0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                         
#define EIE1_EADC0__BMASK    0x08 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT    0x03 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED 0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED  0x08 ///< Enable interrupt requests generated by the ADINT  
                                  ///< flag.                                             
                                                                                         
#define EIE1_EPCA0__BMASK    0x10 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT    0x04 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED 0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED  0x10 ///< Enable interrupt requests generated by PCA0.      
                                                                                         
#define EIE1_ECP0__BMASK     0x20 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__SHIFT     0x05 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__DISABLED  0x00 ///< Disable CP0 interrupts.                           
#define EIE1_ECP0__ENABLED   0x20 ///< Enable interrupt requests generated by the        
                                  ///< comparator 0 CPRIF or CPFIF flags.                
                                                                                         
#define EIE1_ET3__BMASK      0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT      0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED   0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED    0x80 ///< Enable interrupt requests generated by the TF3L or
                                  ///< TF3H flags.                                       
                                                                                         
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK 0x01 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__SHIFT 0x00 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__LOW   0x00 ///< SMB0 interrupt set to low priority level.                   
#define EIP1_PSMB0__HIGH  0x01 ///< SMB0 interrupt set to high priority level.                  
                                                                                                
